In [1]:
import pandas as pd
import numpy as np
  
# initialize list of lists 
data = np.array([[32, 256, 5, 102, 74, 171, 270, 111, 209, 24],
                [1, 258, 257, 281, 10, 269, 14, 13, 272, 273],
                [258, 260, 264, 11, 271, 288, 294, 300, 301],
                [9, 10, 11, 12, 22, 28],
                [1, 514, 2, 516, 4, 13, 526, 527, 1037, 529, 256, 678],
                [1, 1028, 7, 9, 1033, 15, 1047, 25, 546, 1061],
                [258, 259, 514, 261, 131, 135, 520, 265, 1028, 50],
                [2, 11, 12, 526, 1044, 22, 23, 27, 541, 54, 88],
                [332, 168, 79, 343, 38, 1007, 9, 232, 381, 1079],
                [38, 168, 561, 542, 69, 20, 79, 385, 332, 480]])

data

array([list([32, 256, 5, 102, 74, 171, 270, 111, 209, 24]),
       list([1, 258, 257, 281, 10, 269, 14, 13, 272, 273]),
       list([258, 260, 264, 11, 271, 288, 294, 300, 301]),
       list([9, 10, 11, 12, 22, 28]),
       list([1, 514, 2, 516, 4, 13, 526, 527, 1037, 529, 256, 678]),
       list([1, 1028, 7, 9, 1033, 15, 1047, 25, 546, 1061]),
       list([258, 259, 514, 261, 131, 135, 520, 265, 1028, 50]),
       list([2, 11, 12, 526, 1044, 22, 23, 27, 541, 54, 88]),
       list([332, 168, 79, 343, 38, 1007, 9, 232, 381, 1079]),
       list([38, 168, 561, 542, 69, 20, 79, 385, 332, 480])], dtype=object)

In [2]:
data = pd.DataFrame(data)
data

                                                   0
0      [32, 256, 5, 102, 74, 171, 270, 111, 209, 24]
1      [1, 258, 257, 281, 10, 269, 14, 13, 272, 273]
2       [258, 260, 264, 11, 271, 288, 294, 300, 301]
3                            [9, 10, 11, 12, 22, 28]
4  [1, 514, 2, 516, 4, 13, 526, 527, 1037, 529, 2...
5     [1, 1028, 7, 9, 1033, 15, 1047, 25, 546, 1061]
6  [258, 259, 514, 261, 131, 135, 520, 265, 1028,...
7    [2, 11, 12, 526, 1044, 22, 23, 27, 541, 54, 88]
8   [332, 168, 79, 343, 38, 1007, 9, 232, 381, 1079]
9     [38, 168, 561, 542, 69, 20, 79, 385, 332, 480]

In [3]:
test_actual = data.rename(columns={0: "Actual"})
test_actual

                                              Actual
0      [32, 256, 5, 102, 74, 171, 270, 111, 209, 24]
1      [1, 258, 257, 281, 10, 269, 14, 13, 272, 273]
2       [258, 260, 264, 11, 271, 288, 294, 300, 301]
3                            [9, 10, 11, 12, 22, 28]
4  [1, 514, 2, 516, 4, 13, 526, 527, 1037, 529, 2...
5     [1, 1028, 7, 9, 1033, 15, 1047, 25, 546, 1061]
6  [258, 259, 514, 261, 131, 135, 520, 265, 1028,...
7    [2, 11, 12, 526, 1044, 22, 23, 27, 541, 54, 88]
8   [332, 168, 79, 343, 38, 1007, 9, 232, 381, 1079]
9     [38, 168, 561, 542, 69, 20, 79, 385, 332, 480]

In [4]:
# Add columns here
test_actual['userId'] = [1,2,3,5,6,8,10,12,15,18]
test_actual = test_actual.set_index('userId')
test_actual

                                                   Actual
userId
1           [32, 256, 5, 102, 74, 171, 270, 111, 209, 24]
2           [1, 258, 257, 281, 10, 269, 14, 13, 272, 273]
3            [258, 260, 264, 11, 271, 288, 294, 300, 301]
5                                 [9, 10, 11, 12, 22, 28]
6       [1, 514, 2, 516, 4, 13, 526, 527, 1037, 529, 2...
8          [1, 1028, 7, 9, 1033, 15, 1047, 25, 546, 1061]
10      [258, 259, 514, 261, 131, 135, 520, 265, 1028,...
12        [2, 11, 12, 526, 1044, 22, 23, 27, 541, 54, 88]
15       [332, 168, 79, 343, 38, 1007, 9, 232, 381, 1079]
18         [38, 168, 561, 542, 69, 20, 79, 385, 332, 480]

In [5]:
type(test_actual)

pandas.core.frame.DataFrame

In [6]:
data2 = [[154, 248, 237, 223, 83, 283, 69, 32, 480, 325],         #32
         [332, 168, 38, 9, 385, 258, 561, 41, 79, 542],           #258
         [322, 258, 226, 232, 1007, 343, 332, 260, 561, 381],     #258,260
         [237, 154, 196, 223, 523, 277, 226, 748, 323, 28],       #28
         [168, 332, 38, 9, 83, 561, 232, 526, 1007, 20],          #526
         [79, 38, 480, 168, 232, 561, 653, 9, 542, 996],          #9
         [9, 232, 332, 523, 168, 322, 7, 1028, 41, 542],          #1028
         [83, 168, 232, 322, 385, 223, 154, 941, 283, 12],        #12
         [69, 38, 196, 480, 83, 385, 20, 343, 283, 542],          #38,343
         [480, 38, 69, 83, 385, 154, 542, 941, 283, 223]]         #480,69,38,385,542
data2

[[154, 248, 237, 223, 83, 283, 69, 32, 480, 325],
 [332, 168, 38, 9, 385, 258, 561, 41, 79, 542],
 [322, 258, 226, 232, 1007, 343, 332, 260, 561, 381],
 [237, 154, 196, 223, 523, 277, 226, 748, 323, 28],
 [168, 332, 38, 9, 83, 561, 232, 526, 1007, 20],
 [79, 38, 480, 168, 232, 561, 653, 9, 542, 996],
 [9, 232, 332, 523, 168, 322, 7, 1028, 41, 542],
 [83, 168, 232, 322, 385, 223, 154, 941, 283, 12],
 [69, 38, 196, 480, 83, 385, 20, 343, 283, 542],
 [480, 38, 69, 83, 385, 154, 542, 941, 283, 223]]

In [7]:
test_actual['Predict'] = data2
test_actual

                                                   Actual                                            Predict
userId
1           [32, 256, 5, 102, 74, 171, 270, 111, 209, 24]    [154, 248, 237, 223, 83, 283, 69, 32, 480, 325]
2           [1, 258, 257, 281, 10, 269, 14, 13, 272, 273]      [332, 168, 38, 9, 385, 258, 561, 41, 79, 542]
3            [258, 260, 264, 11, 271, 288, 294, 300, 301]  [322, 258, 226, 232, 1007, 343, 332, 260, 561,...
5                                 [9, 10, 11, 12, 22, 28]  [237, 154, 196, 223, 523, 277, 226, 748, 323, 28]
6       [1, 514, 2, 516, 4, 13, 526, 527, 1037, 529, 2...     [168, 332, 38, 9, 83, 561, 232, 526, 1007, 20]
8          [1, 1028, 7, 9, 1033, 15, 1047, 25, 546, 1061]     [79, 38, 480, 168, 232, 561, 653, 9, 542, 996]
10      [258, 259, 514, 261, 131, 135, 520, 265, 1028,...     [9, 232, 332, 523, 168, 322, 7, 1028, 41, 542]
12        [2, 11, 12, 526, 1044, 22, 23, 27, 541, 54, 88]   [83, 168, 232, 322, 385, 223, 154, 941, 283, 12]
15       [332, 168, 79, 343, 38, 1007, 9, 232, 381, 1079]     [69, 38, 196, 480, 83, 385, 20, 343, 283, 542]
18         [38, 168, 561, 542, 69, 20, 79, 385, 332, 480]    [480, 38, 69, 83, 385, 154, 542, 941, 283, 223]

In [8]:
# for user in range(0, len(test_actual.index)):
for user in test_actual.index:
  print(user)

1
2
3
5
6
8
10
12
15
18

In [9]:
result = test_actual.apply(lambda x: len(np.intersect1d(x['Actual'],x['Predict'])), axis = 1)
result

userId
1     1
2     1
3     2
5     1
6     1
8     1
10    1
12    1
15    2
18    5
dtype: int64

In [19]:
# The total number of intersect items
print(sum(result))

16

In [12]:
print("Common items in both two arrays:")
test_actual.apply(lambda x: np.intersect1d(x['Actual'],x['Predict']), axis = 1)

Common items in both two arrays:

userId
1                        [32]
2                       [258]
3                  [258, 260]
5                        [28]
6                       [526]
8                         [9]
10                     [1028]
12                       [12]
15                  [38, 343]
18    [38, 69, 385, 480, 542]
dtype: object

In [11]:
(test_actual.apply(lambda x: set(x['Actual']).intersection(set(x['Predict'])), axis=1))

userId
1                        {32}
2                       {258}
3                  {258, 260}
5                        {28}
6                       {526}
8                         {9}
10                     {1028}
12                       {12}
15                  {38, 343}
18    {480, 385, 69, 38, 542}
dtype: object